Week9/A_crossFlowHESteady/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0) //0
    (0.5 0 0) //1
    (0.5 0.1 0) //2
    (0 0.1 0) //3
    (0 0 0.2) //4
    (0.5 0 0.2) //5
    (0.5 0.1 0.2) //6
    (0 0.1 0.2) //7
);


blocks
(
      hex (0 1 2 3 4 5 6 7) fluidA (50 20 20) simpleGrading (1 1 1) //Note the cellZone name
);

edges
(
);

boundary
(
    walls
    {
        type wall;
        faces
        (
            (4 0 1 5)
            (3 7 6 2)
        );
    }

    inletOther //Inlet for tubes
    {
        type wall;
        faces
        (
            (3 2 1 0)
        );  
    }

    outletOther  //Outlet for tubes
    {
        type wall;
        faces
        (
            (5 6 7 4)
        );  
    }

    inlet //Channel inlet
    {
        type patch;
        faces
        (
             (3 0 4 7)
        );  
    }

    outlet //Channel outlet
    {
        type patch;
        faces
        (
             (1 2 6 5)
        );  
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
