Week9/A_crossFlowHESteady/0.org/fluidB/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    location    "0/fluidB";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inletOther
    {
        type            fixedValue;
        value           uniform (0 0 0.5);
    }
    outletOther
    {
        type            zeroGradient;
    }
    fluidB_to_fluidA
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
