Week9/A_crossFlowHESteady/0.org/fluidB/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/fluidB";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    inletOther
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.005;
        value           $internalField;
    }
    outletOther
    {
        type            inletOutlet;
        inletValue      $internalField;
    }
    fluidB_to_fluidA
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
}


// ************************************************************************* //
